experiments/socialnetwork_singlenode/expected_results/mixed_qps5500/wrk_warmup.log
Running 30s test @ http://ip-172-31-2-175.us-east-2.compute.internal:8080
  4 threads and 64 connections
  Thread calibration: mean lat.: 4.678ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 4.751ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 4.722ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 4.692ms, rate sampling interval: 14ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.17ms    2.43ms  28.82ms   73.88%
    Req/Sec     1.43k   167.51     2.14k    70.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.13ms
 75.000%    6.03ms
 90.000%    7.80ms
 99.000%   10.85ms
 99.900%   15.22ms
 99.990%   23.07ms
 99.999%   28.13ms
100.000%   28.83ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.734     0.000000            1         1.00
       1.937     0.100000        10971         1.11
       2.271     0.200000        21979         1.25
       2.543     0.300000        32900         1.43
       2.815     0.400000        43872         1.67
       3.131     0.500000        54775         2.00
       3.333     0.550000        60273         2.22
       3.601     0.600000        65756         2.50
       4.051     0.650000        71217         2.86
       5.191     0.700000        76694         3.33
       6.035     0.750000        82166         4.00
       6.343     0.775000        84930         4.44
       6.619     0.800000        87671         5.00
       6.891     0.825000        90395         5.71
       7.171     0.850000        93116         6.67
       7.467     0.875000        95881         8.00
       7.623     0.887500        97253         8.89
       7.795     0.900000        98625        10.00
       7.979     0.912500        99963        11.43
       8.187     0.925000       101335        13.33
       8.431     0.937500       102734        16.00
       8.567     0.943750       103405        17.78
       8.719     0.950000       104075        20.00
       8.903     0.956250       104768        22.86
       9.087     0.962500       105457        26.67
       9.327     0.968750       106130        32.00
       9.471     0.971875       106485        35.56
       9.615     0.975000       106821        40.00
       9.791     0.978125       107152        45.71
       9.975     0.981250       107504        53.33
      10.223     0.984375       107842        64.00
      10.367     0.985938       108016        71.11
      10.511     0.987500       108178        80.00
      10.727     0.989062       108358        91.43
      10.967     0.990625       108526       106.67
      11.247     0.992188       108691       128.00
      11.391     0.992969       108780       142.22
      11.623     0.993750       108863       160.00
      11.927     0.994531       108949       182.86
      12.199     0.995313       109036       213.33
      12.519     0.996094       109120       256.00
      12.719     0.996484       109162       284.44
      12.911     0.996875       109204       320.00
      13.127     0.997266       109247       365.71
      13.471     0.997656       109291       426.67
      13.791     0.998047       109333       512.00
      13.967     0.998242       109355       568.89
      14.175     0.998437       109376       640.00
      14.391     0.998633       109398       731.43
      14.815     0.998828       109419       853.33
      15.287     0.999023       109440      1024.00
      15.559     0.999121       109450      1137.78
      15.791     0.999219       109461      1280.00
      16.111     0.999316       109472      1462.86
      16.527     0.999414       109483      1706.67
      17.167     0.999512       109493      2048.00
      17.343     0.999561       109499      2275.56
      17.871     0.999609       109504      2560.00
      18.767     0.999658       109509      2925.71
      19.247     0.999707       109514      3413.33
      20.239     0.999756       109520      4096.00
      20.527     0.999780       109522      4551.11
      21.119     0.999805       109525      5120.00
      21.631     0.999829       109528      5851.43
      22.591     0.999854       109530      6826.67
      22.959     0.999878       109533      8192.00
      23.023     0.999890       109534      9102.22
      23.887     0.999902       109536     10240.00
      24.047     0.999915       109537     11702.86
      24.879     0.999927       109538     13653.33
      26.239     0.999939       109540     16384.00
      26.239     0.999945       109540     18204.44
      26.271     0.999951       109541     20480.00
      26.351     0.999957       109542     23405.71
      26.351     0.999963       109542     27306.67
      27.327     0.999969       109543     32768.00
      27.327     0.999973       109543     36408.89
      27.855     0.999976       109544     40960.00
      27.855     0.999979       109544     46811.43
      27.855     0.999982       109544     54613.33
      28.127     0.999985       109545     65536.00
      28.127     0.999986       109545     72817.78
      28.127     0.999988       109545     81920.00
      28.127     0.999989       109545     93622.86
      28.127     0.999991       109545    109226.67
      28.831     0.999992       109546    131072.00
      28.831     1.000000       109546          inf
#[Mean    =        4.166, StdDeviation   =        2.425]
#[Max     =       28.816, Total count    =       109546]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    2.34ms
 75.000%    5.36ms
 90.000%    6.99ms
 99.000%    9.97ms
 99.900%   13.69ms
 99.990%   20.90ms
 99.999%   27.07ms
100.000%   27.76ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.606     0.000000            1         1.00
       1.385     0.100000        10964         1.11
       1.671     0.200000        21961         1.25
       1.870     0.300000        32888         1.43
       2.077     0.400000        43822         1.67
       2.343     0.500000        54840         2.00
       2.521     0.550000        60295         2.22
       2.773     0.600000        65756         2.50
       3.195     0.650000        71221         2.86
       4.531     0.700000        76694         3.33
       5.355     0.750000        82187         4.00
       5.623     0.775000        84908         4.44
       5.879     0.800000        87651         5.00
       6.139     0.825000        90398         5.71
       6.403     0.850000        93123         6.67
       6.683     0.875000        95876         8.00
       6.843     0.887500        97237         8.89
       6.995     0.900000        98621        10.00
       7.175     0.912500        99978        11.43
       7.379     0.925000       101348        13.33
       7.619     0.937500       102714        16.00
       7.751     0.943750       103385        17.78
       7.915     0.950000       104077        20.00
       8.075     0.956250       104754        22.86
       8.263     0.962500       105456        26.67
       8.495     0.968750       106142        32.00
       8.615     0.971875       106473        35.56
       8.767     0.975000       106822        40.00
       8.935     0.978125       107157        45.71
       9.127     0.981250       107503        53.33
       9.367     0.984375       107844        64.00
       9.519     0.985938       108017        71.11
       9.671     0.987500       108181        80.00
       9.839     0.989062       108350        91.43
      10.063     0.990625       108524       106.67
      10.319     0.992188       108695       128.00
      10.503     0.992969       108781       142.22
      10.663     0.993750       108865       160.00
      10.887     0.994531       108948       182.86
      11.127     0.995313       109033       213.33
      11.471     0.996094       109119       256.00
      11.615     0.996484       109165       284.44
      11.823     0.996875       109205       320.00
      12.055     0.997266       109247       365.71
      12.215     0.997656       109290       426.67
      12.543     0.998047       109333       512.00
      12.791     0.998242       109354       568.89
      12.991     0.998437       109375       640.00
      13.167     0.998633       109397       731.43
      13.439     0.998828       109418       853.33
      13.743     0.999023       109440      1024.00
      13.911     0.999121       109451      1137.78
      14.087     0.999219       109463      1280.00
      14.255     0.999316       109472      1462.86
      14.671     0.999414       109482      1706.67
      15.071     0.999512       109493      2048.00
      15.367     0.999561       109498      2275.56
      15.535     0.999609       109504      2560.00
      15.711     0.999658       109509      2925.71
      15.855     0.999707       109514      3413.33
      17.055     0.999756       109520      4096.00
      17.343     0.999780       109522      4551.11
      18.223     0.999805       109525      5120.00
      19.055     0.999829       109529      5851.43
      19.471     0.999854       109530      6826.67
      19.839     0.999878       109533      8192.00
      20.127     0.999890       109534      9102.22
      21.023     0.999902       109536     10240.00
      21.951     0.999915       109538     11702.86
      21.951     0.999927       109538     13653.33
      22.543     0.999939       109540     16384.00
      22.543     0.999945       109540     18204.44
      22.703     0.999951       109541     20480.00
      23.407     0.999957       109542     23405.71
      23.407     0.999963       109542     27306.67
      23.487     0.999969       109543     32768.00
      23.487     0.999973       109543     36408.89
      25.759     0.999976       109544     40960.00
      25.759     0.999979       109544     46811.43
      25.759     0.999982       109544     54613.33
      27.071     0.999985       109545     65536.00
      27.071     0.999986       109545     72817.78
      27.071     0.999988       109545     81920.00
      27.071     0.999989       109545     93622.86
      27.071     0.999991       109545    109226.67
      27.759     0.999992       109546    131072.00
      27.759     1.000000       109546          inf
#[Mean    =        3.455, StdDeviation   =        2.348]
#[Max     =       27.744, Total count    =       109546]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  164794 requests in 30.00s, 42.73MB read
Requests/sec:   5493.09
Transfer/sec:      1.42MB